<!-- add-pr-comment:eks_plan -->

# production/eks Terragrunt Plan:
```shell
Terraform will perform the following actions:
  # aws_iam_policy.velero will be created
  + resource "aws_iam_policy" "velero" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "Policy for Velero backup and restore operations"
      + id               = (known after apply)
      + name             = "notification-canada-ca-production-eks-cluster-velero-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = (known after apply)
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }
  # aws_iam_role.velero will be created
  + resource "aws_iam_role" "velero" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:aud" = "sts.amazonaws.com"
                              + "oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60:sub" = "system:serviceaccount:velero:velero-server"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::296255494825:oidc-provider/oidc.eks.ca-central-1.amazonaws.com/id/BB1100A5BF4708019EB3830B49BF6B60"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "notification-canada-ca-production-eks-cluster-velero-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Name" = "notification-canada-ca-production-eks-cluster-velero-role"
        }
      + tags_all              = {
          + "Name" = "notification-canada-ca-production-eks-cluster-velero-role"
        }
      + unique_id             = (known after apply)
      + inline_policy (known after apply)
    }
  # aws_iam_role_policy_attachment.velero will be created
  + resource "aws_iam_role_policy_attachment" "velero" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "notification-canada-ca-production-eks-cluster-velero-role"
    }
  # aws_s3_bucket.velero_backups will be created
  + resource "aws_s3_bucket" "velero_backups" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "notification-canada-ca-production-eks-cluster-velero-backups"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ca-central-1"
      + request_payer               = (known after apply)
      + tags                        = {
          + "Name" = "notification-canada-ca-production-eks-cluster-velero-backups"
        }
      + tags_all                    = {
          + "Name" = "notification-canada-ca-production-eks-cluster-velero-backups"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
      + cors_rule (known after apply)
      + grant (known after apply)
      + lifecycle_rule (known after apply)
      + logging (known after apply)
      + object_lock_configuration (known after apply)
      + replication_configuration (known after apply)
      + server_side_encryption_configuration (known after apply)
      + versioning (known after apply)
      + website (known after apply)
    }
  # aws_s3_bucket_lifecycle_configuration.velero_backups will be created
  + resource "aws_s3_bucket_lifecycle_configuration" "velero_backups" {
      + bucket                                 = (known after apply)
      + expected_bucket_owner                  = (known after apply)
      + id                                     = (known after apply)
      + region                                 = "ca-central-1"
      + transition_default_minimum_object_size = "all_storage_classes_128K"
      + rule {
          + id     = "expire-old-backups"
          + status = "Enabled"
            # (1 unchanged attribute hidden)
          + expiration {
              + days                         = 365
              + expired_object_delete_marker = false
            }
          + noncurrent_version_expiration {
              + noncurrent_days = 90
            }
          + transition {
              + days          = 30
              + storage_class = "STANDARD_IA"
            }
          + transition {
              + days          = 90
              + storage_class = "GLACIER"
            }
        }
    }
  # aws_s3_bucket_notification.velero_backups will be created
  + resource "aws_s3_bucket_notification" "velero_backups" {
      + bucket      = (known after apply)
      + eventbridge = true
      + id          = (known after apply)
      + region      = "ca-central-1"
    }
  # aws_s3_bucket_public_access_block.velero_backups will be created
  + resource "aws_s3_bucket_public_access_block" "velero_backups" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ca-central-1"
      + restrict_public_buckets = true
    }
  # aws_s3_bucket_server_side_encryption_configuration.velero_backups will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "velero_backups" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ca-central-1"
      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }
  # aws_s3_bucket_versioning.velero_backups will be created
  + resource "aws_s3_bucket_versioning" "velero_backups" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ca-central-1"
      + versioning_configuration {
          + mfa_delete = (known after apply)
          + status     = "Enabled"
        }
    }
Plan: 9 to add, 0 to change, 0 to destroy.

# --- End of Plan 1 ---

```